In [3]:
import pandas as pd

In [4]:
read_file = pd.read_csv('IMDB_Rating.csv')
read_file.head(5)

                      title  year  rating
0  The Shawshank Redemption  1994     9.3
1             The Godfather  1972     9.2
2           The Dark Knight  2008     9.0
3     The Godfather Part II  1974     9.0
4              12 Angry Men  1957     9.0

In [5]:
read_file['title']

0     The Shawshank Redemption
1                The Godfather
2              The Dark Knight
3        The Godfather Part II
4                 12 Angry Men
                ...
76                         RRR
77                    Jai Bhim
78             Soorarai Pottru
79                          96
80                  Sita Ramam
Name: title, Length: 81, dtype: object

In [6]:
read_file.loc[1]

title     The Godfather
year               1972
rating              9.2
Name: 1, dtype: object

In [8]:
read_file.iloc[0]

title     The Shawshank Redemption
year                          1994
rating                         9.3
Name: 0, dtype: object

In [9]:
read_file.isnull()

    title   year  rating
0   False  False   False
1   False  False   False
2   False  False   False
3   False  False   False
4   False  False   False
..    ...    ...     ...
76  False  False   False
77  False  False   False
78  False  False   False
79  False  False   False
80  False  False   False

[81 rows x 3 columns]

In [10]:
read_file.isnull().any()

title     False
year      False
rating    False
dtype: bool

In [11]:
read_file.isnull().sum()

title     0
year      0
rating    0
dtype: int64

In [12]:
## Rename
read_file.rename(columns={'rating' : 'IMDB Rating'})

                       title  year  IMDB Rating
0   The Shawshank Redemption  1994          9.3
1              The Godfather  1972          9.2
2            The Dark Knight  2008          9.0
3      The Godfather Part II  1974          9.0
4               12 Angry Men  1957          9.0
..                       ...   ...          ...
76                       RRR  2022          8.0
77                  Jai Bhim  2021          8.8
78           Soorarai Pottru  2020          8.7
79                        96  2018          8.6
80                Sita Ramam  2022          8.5

[81 rows x 3 columns]